gloomyandy/CoreN2G/src/STM32/ConfigurableUART/uart.c
  HAL_UART_DeInit(uart_handlers[obj->index]);

}



/**
  * @brief  write the data on the uart
  * @param  obj : pointer to serial_t structure
  * @param  data : byte to write
  * @param  size : number of data to write
  * @retval The number of bytes written
  */
size_t uart_write(serial_t *obj, uint8_t data, uint16_t size)
{
  if (HAL_UART_Transmit(uart_handlers[obj->index], &data, size, TX_TIMEOUT) == HAL_OK) {
    return size;
  } else {
    return 0;
  }
}

int8_t uart_get_port_number(serial_t *obj)
{
  switch (obj->index) {
#if defined(USART1_BASE)
    case UART1_INDEX:
      return 1;
      break;
#endif
#if defined(USART2_BASE)
    case UART2_INDEX:
      return 2;
      break;
#endif
#if defined(USART3_BASE)
    case UART3_INDEX:
      return 3;
      break;
#endif
#if defined(UART4_BASE)
    case UART4_INDEX:
      return 4;
      break;
#elif defined(USART4_BASE)
    case UART4_INDEX:
      return 4;
      break;
#endif
#if defined(UART5_BASE)
    case UART5_INDEX:
      return 5;
      break;
#elif defined(USART5_BASE)
    case UART5_INDEX:
      return 5;
      break;
#endif
#if defined(USART6_BASE)
    case UART6_INDEX:
      return 6;
      break;
#endif
#if defined(LPUART1_BASE)
    case LPUART1_INDEX:
      return 1;
      break;
#endif
#if defined(UART7_BASE)
    case UART7_INDEX:
       return 7;
      break;
#elif defined(USART7_BASE)
    case UART7_INDEX:
      return 7;
      break;
#endif
#if defined(UART8_BASE)
    case UART8_INDEX:
      return 8;
      break;
#elif defined(USART8_BASE)
    case UART8_INDEX:
      return 8;
      break;
#endif
#if defined(UART9_BASE)
    case UART9_INDEX:
      return 9;
      break;
#endif
#if defined(UART10_BASE)
    case UART10_INDEX:
      return 10;
      break;
#endif
  }
  return -1;
}

/**
 * Attempts to determine if the serial peripheral is already in use for RX
 *
 * @param obj The serial object
 * @return Non-zero if the RX transaction is ongoing, 0 otherwise
 */
uint8_t serial_rx_active(serial_t *obj)
{
  return ((HAL_UART_GetState(uart_handlers[obj->index]) & HAL_UART_STATE_BUSY_RX) == HAL_UART_STATE_BUSY_RX);
}

/**
 * Attempts to determine if the serial peripheral is already in use for TX
 *
 * @param obj The serial object
 * @return Non-zero if the TX transaction is ongoing, 0 otherwise
 */
uint8_t serial_tx_active(serial_t *obj)
{
  return ((HAL_UART_GetState(uart_handlers[obj->index]) & HAL_UART_STATE_BUSY_TX) == HAL_UART_STATE_BUSY_TX);
}


/**
 * Begin asynchronous RX transfer (enable interrupt for data collecting)
 *
 * @param obj : pointer to serial_t structure
 * @retval none
 */
void uart_start_rx(serial_t *obj)
{
  if (obj == NULL) {
    return;
  }

  /* Exit if a reception is already on-going */
  if (serial_rx_active(obj)) {
    return;
  }
  HAL_UART_Receive_IT(uart_handlers[obj->index], &(obj->rx_buff[0]), SERIAL_RX_BUFFER_SIZE);      
}

/**
 * Begin asynchronous TX transfer.
 *
 * @param obj : pointer to serial_t structure
 * @retval none
 */
void uart_start_tx(serial_t *obj)
{
  if (obj == NULL) {
    return;
  }

  if (!serial_tx_active(obj) && obj->tx_tail != obj->tx_head) {
    HAL_UART_Transmit_IT(uart_handlers[obj->index], &obj->tx_buff[obj->tx_tail], 1);
  }
}

void uart_set_interrupt_priority(serial_t *obj, uint32_t priority)
{
  HAL_NVIC_SetPriority(obj->irq, priority, 0);
}


/**
  * @brief  Return index of the serial handler
  * @param  UartHandle pointer on the uart reference
  * @retval index
  */
/*
uint8_t uart_index(UART_HandleTypeDef *huart)
{
  uint8_t i = 0;
  if (huart == NULL) {
    return UART_NUM;
  }

  for (i = 0; i < UART_NUM; i++) {
    if (huart == uart_handlers[i]) {
      break;
    }
  }

  return i;
}
*/


/**
  * @brief  error callback from UART
  * @param  UartHandle pointer on the uart reference
  * @retval None
  */
void UART_ErrorCallback(UART_HandleTypeDef *huart)
{
  /* Restart receive interrupt after any error */
  serial_t *obj = get_serial_obj(huart);
  if (obj) {
    obj->hw_error++;
    if (!serial_rx_active(obj)) {
      HAL_UART_Receive_IT(uart_handlers[obj->index], &(obj->rx_buff[obj->rx_head]), 1);
    }
  }
}

/**
  * @brief  Receives an amount of data in non blocking mode
  * @param  huart  Pointer to a UART_HandleTypeDef structure that contains
  *                the configuration information for the specified UART module.
  * @retval HAL status
  */
static inline HAL_StatusTypeDef UART_Receive_IT(UART_HandleTypeDef *huart)
{
  serial_t *obj = get_serial_obj(huart);
#if STM32H7
  uint8_t val = (uint8_t)(huart->Instance->RDR & (uint8_t)0x00FF);
#else
  uint8_t val = (uint8_t)(huart->Instance->DR & (uint8_t)0x00FF);
#endif
  uint32_t pos = (obj->rx_head + 1) % SERIAL_RX_BUFFER_SIZE;
  if (pos != obj->rx_tail)
  {
    obj->rx_buff[obj->rx_head] = val;
    obj->rx_head = pos;
  }
  else
    obj->rx_full++;
  return HAL_OK;
}

/**
  * @brief  Sends an amount of data in non blocking mode.
  * @param  huart  Pointer to a UART_HandleTypeDef structure that contains
  *                the configuration information for the specified UART module.
  * @retval HAL status
  */
static inline HAL_StatusTypeDef UART_Transmit_IT(UART_HandleTypeDef *huart)
{
  serial_t *obj = get_serial_obj(huart);
  // write the data
#if STM32H7
  huart->Instance->TDR = obj->tx_buff[obj->tx_tail];
#else
  huart->Instance->DR = obj->tx_buff[obj->tx_tail];
#endif
  // update write pointer
  obj->tx_tail = (obj->tx_tail + 1) % SERIAL_TX_BUFFER_SIZE;
  // do we have more to send?
  if (obj->tx_tail == obj->tx_head)
  {
    /* Disable the UART Transmit empty Interrupt */
    __HAL_UART_DISABLE_IT(huart, UART_IT_TXE);

    /* Enable the UART Transmit Complete Interrupt */
    __HAL_UART_ENABLE_IT(huart, UART_IT_TC);
  }
  return HAL_OK;
}

/**
  * @brief  Wraps up transmission in non blocking mode.
  * @param  huart  Pointer to a UART_HandleTypeDef structure that contains
  *                the configuration information for the specified UART module.
  * @retval HAL status
  */
static HAL_StatusTypeDef UART_EndTransmit_IT(UART_HandleTypeDef *huart)
{
  serial_t *obj = get_serial_obj(huart);
  // has more data arrived while we waited?
  if (obj->tx_tail != obj->tx_head)
  {
    // Yes so send the data
#if STM32H7
    huart->Instance->TDR = obj->tx_buff[obj->tx_tail];
#else
    huart->Instance->DR = obj->tx_buff[obj->tx_tail];
#endif
    // update write pointer
    obj->tx_tail = (obj->tx_tail + 1) % SERIAL_TX_BUFFER_SIZE;
    // do we have more to send?
    if (obj->tx_tail != obj->tx_head)
    {
      /* Enable the UART Transmit empty Interrupt */
      __HAL_UART_ENABLE_IT(huart, UART_IT_TXE);
      __HAL_UART_DISABLE_IT(huart, UART_IT_TC);
    }
    return HAL_OK;
  }
  // No data left to send
  /* Disable the UART Transmit Complete Interrupt */
  __HAL_UART_DISABLE_IT(huart, UART_IT_TC);
  /* Tx process is ended, restore huart->gState to Ready */
  huart->gState = HAL_UART_STATE_READY;
  return HAL_OK;
}

/**
  * @brief  This function handles UART interrupt request.
  * @param  huart  Pointer to a UART_HandleTypeDef structure that contains
  *                the configuration information for the specified UART module.
  * @retval None
  */
static void UART_IRQHandler(UART_HandleTypeDef *huart)
{
#if STM32H7
  uint32_t isrflags   = READ_REG(huart->Instance->ISR);
  uint32_t errorflags = (isrflags & (uint32_t)(USART_ISR_PE | USART_ISR_FE | USART_ISR_ORE | USART_ISR_NE | USART_ISR_RTOF));
#else
  uint32_t isrflags   = READ_REG(huart->Instance->SR);
  uint32_t errorflags = (isrflags & (uint32_t)(UART_FLAG_PE | UART_FLAG_FE | UART_FLAG_ORE | UART_FLAG_NE));
#endif
  uint32_t cr1its     = READ_REG(huart->Instance->CR1);
  uint32_t cr3its     = READ_REG(huart->Instance->CR3);

  /* If no error occurs */
  if (errorflags == RESET)
  {
    /* UART in mode Receiver -------------------------------------------------*/
    if (((isrflags & UART_FLAG_RXNE) != RESET) && ((cr1its & USART_CR1_RXNEIE) != RESET))
    {
      UART_Receive_IT(huart);
      return;
    }
  }

  /* If some errors occur */
// FIXME: This is a mess different flags on H7/F4
#if STM32H7
  if ((errorflags != 0U)
      && ((((cr3its & (USART_CR3_RXFTIE | USART_CR3_EIE)) != 0U)
           || ((cr1its & (USART_CR1_RXNEIE_RXFNEIE | USART_CR1_PEIE | USART_CR1_RTOIE)) != 0U))))
  {
    /* UART parity error interrupt occurred -------------------------------------*/
    if (((isrflags & USART_ISR_PE) != 0U) && ((cr1its & USART_CR1_PEIE) != 0U))
    {
      __HAL_UART_CLEAR_FLAG(huart, UART_CLEAR_PEF);
      huart->ErrorCode |= HAL_UART_ERROR_PE;
    }

    /* UART frame error interrupt occurred --------------------------------------*/
    if (((isrflags & USART_ISR_FE) != 0U) && ((cr3its & USART_CR3_EIE) != 0U))
    {
      __HAL_UART_CLEAR_FLAG(huart, UART_CLEAR_FEF);
      huart->ErrorCode |= HAL_UART_ERROR_FE;
    }

    /* UART noise error interrupt occurred --------------------------------------*/
    if (((isrflags & USART_ISR_NE) != 0U) && ((cr3its & USART_CR3_EIE) != 0U))
    {
      __HAL_UART_CLEAR_FLAG(huart, UART_CLEAR_NEF);
      huart->ErrorCode |= HAL_UART_ERROR_NE;
    }

    /* UART Over-Run interrupt occurred -----------------------------------------*/
    if (((isrflags & USART_ISR_ORE) != 0U)
        && (((cr1its & USART_CR1_RXNEIE_RXFNEIE) != 0U) ||
            ((cr3its & (USART_CR3_RXFTIE | USART_CR3_EIE)) != 0U)))
    {
      __HAL_UART_CLEAR_FLAG(huart, UART_CLEAR_OREF);
      huart->ErrorCode |= HAL_UART_ERROR_ORE;
    }

    /* UART Receiver Timeout interrupt occurred ---------------------------------*/
    if (((isrflags & USART_ISR_RTOF) != 0U) && ((cr1its & USART_CR1_RTOIE) != 0U))
    {
      __HAL_UART_CLEAR_FLAG(huart, UART_CLEAR_RTOF);
      huart->ErrorCode |= HAL_UART_ERROR_RTO;
    }

